{
 "Low": ["Installation of software and hardware for PCs, Servers, Printers", "OM ENGINEERS  Designation  : QUALITY CONTROL INSPECTOR AS TRAINEE", "BHEL HARIDWAR Curriculum: Summer training after 6th semester","Fresher"],
 "Medium": ["Johnson & Johnson Medical (JJHS – Project handling by Medi Transcare Pvt Ltd) Designation -   Product Specialist Head Quarter – Rajkot and also taking care of Whole Surastra & Kutchh Region From – August 2011 to May 2014 (2 Years and 10 Month)","A total of 2 years 6 months exposures of on-site execution at High Rise Building Projects in Real Estate Construction Industry.","AL YAMAMA CO KSA ELECTRICIAN ETA ABU DHABI ELECTRICIAN ROHINI IN DUST. ELECT. P LTD ELECTRICIAN BRIDGE & ROOF CO I LTD ELECTRICIAN Cable Laying, Cable Glinding, Meaggrig. LCT. JB wirin . Internal & External wiring, Star & Delta Motor U.P.S. System switch gear Wirinl{. l lcct rk nl Equipml:nt ln tallat h.'ll. Conduit work (G.I. & PVC) and tray work and all type of clectrirnl & instnuncntalion wiring that FL IT, FDT, IP, DCS, and control valve wiring. Electrical Machine Re pairins"],
 "High": ["Design & Development Engineer in D&D Deptt., June 2013- Present Understand and Study the complete component drawings. Developing 3D Modelling and 2D drawings (with GD&T) of component and pattern. Finite Element Analysis for stress, strain and deformation analysis with the help of ANSYS software. Casting Simulation to solve methoding and find out defects like shrinkage through ProCAST software before production. Reverse Engineering Process. Machining inspection. Inspection of the products. Defect analysis and then implement the ways to minimize present defect within short time. Process planning & execution. To lead the shop floor as per requirement. (When products are under development Deptt.) Maintain all the records as per international standards.To develop different types of components. Special Purpose Machine to remove burs from sharp corner edges after machining.", "Fixed Data Network Technician Employer : Ben’s Electronics Services Ltd, Mombasa Duties : Survey, Installation, Integration, Maint anance, Support and Decommissioning of Fixed Data Services using various Access Technologies (WIMAX, FIBER, MICROWAVES and Wi-Fi) for Safaricom Ltd. Survey, Installation and Support of Ceragon’s IP20 Access Technology for Airtel (K) Survey , Installation and Support of Cambridge P2MP Solutions for Safaricom. Fiber Optics Splicing and terminations, deployment, support and maintenance WAN/LAN Design, installation and Technical Support (Structured Cabling) Installation and support for CCTV, IP Cameras, Biometrics Security Controls. Installation and Support for RADWIN P2P Links and Ceragon PTMP,Links. Installation and support for Telrad Wimax BTS WI-FI setup, maintenance and Support. E1 and SIP/VoIP installation and support Systems Integration on Cisco, HP and Huawei Platforms for MPLS, P2P,VPN and Internet. Fixed LTE installation for Safaricom’s Enterprise clients.","Working as a Customer Relationship Manager in Pelican Insurance Broking Pvt. Worked as Relationship Manager at FutRisk Insurance Broking Pvt. Ltd.(April 2013- sep 2014 ).Worked as Senior Sales Executive Officer at Cholamandalam Ms General Insurance Co. Ltd. ( May 2011- Mar 2013 ).","Annual maintenance of HVAC system at one of biggest steel and power plant of the country.Handling the contractors/ sub- contractors and provide technical support. Leading team, arrange training session on chillers/DX system / Package ac / VRF of HVAC Monitoring the performance of team members to ensure efficiency in testing and tools.Efficiently coordinating meeting with the team members for execution of project.Achieve financial target of every month.","Designation : Engineer (Design & Development) Details : As per RFQ make BOM for costing, After That make 3D Model as well as material selection for product & child part. Make master development Schedule, Design micro plan, APQP Timing Chart, Packaging Concept & SPM Finalisation for Product, Do Tech Review & Spec Review with Customers., Make DFMEA, Sample preparation, PPAP documentation."]
}